README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#orgc7197b5)
2.  [Resumo e/ou informação extra:](#org68c4b4e)
3.  [Versão:](#org05ccb6b)
4.  [Data:](#orgb13bbc0)
5.  [Autor de Contato:](#org28ad0e3)
6.  [Lista dos Autores:](#org5a5772d)
7.  [Áreas de pesquisa vinculadas:](#org773bbff)
8.  [Vinculo com:](#org023f40f)
9.  [Paradigmas:](#org0f4654a)
10. [Tipo de Interface:](#org1c7a9f3)
11. [Plataformas Suportadas:](#org78c36fa)
12. [Linguagens Utilizadas:](#org1b93506)
13. [Bibliotecas Utilizadas (dependências):](#orgbc8c2fa)
14. [Softwares utilizados (dependências)](#org3ed8105)
15. [Tipo de Licença:](#org3ae6b58)
16. [Links:](#orgaca5c0b)


<a id="orgc7197b5"></a>

# Nome do Software (ou Biblioteca):

-   Software para tratamentos de dados FT-ICR MS e aplicações geoquímicas


<a id="org68c4b4e"></a>

# Resumo e/ou informação extra:

-   Facilitar o uso da petroleômica.

– Calcular o número de carbono, hidrogênio e nitrogênio.
– Calcular a distribuição heteroatômica para cada amostra.
– Calcular o número de DBE e sua distribuição para cada classe heteroatômica.
– Calcular a distribuição do número de carbono por DBE para cada classe hete-
roatômica.
– Calcular parâmetros geoquímicos com os dados petroleômicos.
– Plotar gráficos e diagramas.
– Modelagem estática do software (diagramas de caso de uso, pacotes e classes).
– Modelagem dinâmica do software (desenvolver algorítimos e diagramas exem-
plificando os fluxos de processamento).
– Simular (realizar simulações para teste do software desenvolvido)
– Implementar Manual simplificado de uso do software.


<a id="org05ccb6b"></a>

# Versão:

-   1.0.


<a id="orgb13bbc0"></a>

# Data:

-   2021/2 - segundo semestre.


<a id="org28ad0e3"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org5a5772d"></a>

# Lista dos Autores:

-   Jimmy Ribeiro Barreto
-   Lucas Ignácio Hespanhol
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org773bbff"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Geoquímica


<a id="org023f40f"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="org0f4654a"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org1c7a9f3"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org78c36fa"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org1b93506"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orgbc8c2fa"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org3ed8105"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org3ae6b58"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orgaca5c0b"></a>

# Links:

